app/controllers/posts_controller.rb

  def index  # indexアクションを定義した
    @posts = Post.all  # すべてのレコードを@postsに代入
---
SELECT `posts`.* FROM `posts`

  def create
    Post.create(content: params[:content])
---
INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('お腹減ったよーーー', '2021-08-13 04:47:24.315111', '2021-08-13 04:47:24.315111')